%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%F_act_dg_under1.m ver.240621%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

function [obj_select,index_select]=F_act_dg_under1(W,p)
    %準備
    r=size(W,2);%今回考えるモードの数．
    index_select=zeros(p,1);%選択した点の番号を格納する列ベクトル．選択した順に上から格納される．
    obj_select=zeros(p,1);%選択した点の目的関数を格納する列ベクトル．選択した順に上から格納される．
    Ws=zeros(p,r);%Wから抽出した行列Ws．ループごとに配列の大きさが変わらないように，最初に定義しておく．
    WWAI=zeros(p,p);%左上からinv(Wk*Wk')を入れていく．ループごとに配列の大きさが変わらないように，最初にp×pのサイズで定義しておく．
    WWAI_new=zeros(p,p);%更新のために用意した変数
    %アクチュエータの選択
    for k=1:p%kはアクチュエータ番号
        %1個目
        if k==1
            obj=sum(abs(W).^2,2);%目的関数の値から構成される列ベクトル（w_iに関する目的関数の値は，i行目の要素となる．)
        %2個目以降
        else
            F=eye(r)-Ws(1:k-1,:)'*WWAI(1:k-1,1:k-1)*Ws(1:k-1,:);%r次正方行列．'は複素共役であることに注意．
            obj=sum((W*F).*conj(W),2);%目的関数の値から構成される列ベクトル（w_iに関する目的関数の値は，i行目の要素となる．)
            obj=abs(obj);%数学的にはobjの要素は実数となる（はずだ）が，数値計算上では僅かに虚部をもってしまうため，絶対値を取る．
            obj(index_select(1:k-1,1),1)=-Inf;%既に選択した要素を再度選択しないようにマイナス無限大を入力．ループごとにobjが計算し直されるので，毎回マイナス無限大を入力する必要がある．
        end
        %目的関数が最大となる要素を探して記録
        [obj_max,index_obj_max]=max(obj);%最大値が複数存在する場合は，番号の若いほうが選択される．
        index_select(k,1)=index_obj_max;
        obj_select(k,1)=obj_max;
        %次のループのためにWsを更新
        Ws(k,:)=W(index_obj_max,:);
        %次のループのためにWWAIを更新
        if k==1
            WWAI(1,1)=1/(Ws(1,:)*Ws(1,:)');
        else
            denominator=Ws(k,:)*(eye(r)-Ws(1:k-1,:)'*WWAI(1:k-1,1:k-1)*Ws(1:k-1,:))*Ws(k,:)';%共通の分母．スカラー．
            WWAI_new(1:k-1,1:k-1)=WWAI(1:k-1,1:k-1)*(eye(k-1)+Ws(1:k-1,:)*Ws(k,:)'*Ws(k,:)*Ws(1:k-1,:)'*WWAI(1:k-1,1:k-1)/denominator);%a．
            WWAI_new(k,1:k-1)=-Ws(k,:)*Ws(1:k-1,:)'*WWAI(1:k-1,1:k-1)/denominator;%b
            WWAI_new(1:k-1,k)=WWAI_new(k,1:k-1)';%b'
            WWAI_new(k,k)=1/denominator;%d
            WWAI=WWAI_new;
        end
    end
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%